[
  {
    "name": "Ability Score Improvement",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": -1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "Increase one ability score of your choice by 1. This feat can't increase an ability score above 20.<br>If you gain this feat multiple times at the same instance (for example at specific Level Ups), you can't increase an ability score more than two times."
  },
  {
    "name": "Acrobat",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Fast as a Feather.</b> Increase your walking speed by 5 feet.<br><b>Light as a Feather.</b> You can fall up to 20 feet without taking damage. Damage incurred from falling beyond that distance is calculated as if you fell 20 feet less than the actual distance.<br><b>Skittish as a Feather.</b> When an enemy hits you with a melee attack, you can use your reaction to prepare yourself to disengage. Until the end of your next turn, your movement doesn’t provoke opportunity attacks from that creature.<br><b>Agile Dodger.</b> When you take the Dodge action, you can immediately move 5 feet in any direction without provoking opportunity attacks, in addition to your normal movement.<br><b>Nimble Dodger.</b> You have advantage on any Strength (Athletics) or Dexterity (Acrobatics) check you make to escape from being grappled."
  },
  {
    "name": "Actor",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Impersonation.</b> While you're disguised as a real or fictional person, you have an Advantage on Charisma (Deception or Performance) checks to convince others that you are that person.<br><b>Mimicry.</b> You can mimic the sounds of other creatures, including speech. A creature that hears the mimicry must succeed on a Wisdom (Insight) check to determine the effect is faked (DC 8 plus your Charisma modifier and Proficiency Bonus)."
  },
  {
    "name": "Alert",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Initiative Proficiency.</b> When you roll Initiative, you can add your Proficiency Bonus to the roll.<br><b>Initiative Swap.</b> Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can't make this swap if you or the ally has the Incapacitated condition."
  },
  {
    "name": "Athlete",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Climb Speed.</b>You gain a Climb Speed equal to your Speed.<br><b>Hop Up.</b> When you are prone, standing up uses only 5 feet of your movement.<br><b>Jumping.</b> You can make a running Long Jump or High Jump after moving only 5 feet on foot, rather than 10 feet.<br><b>Marathon Runner.</b> You have Advantage on Constitution saving throws for the purpose of Forced March when traveling."
  },
  {
    "name": "Charger",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Improved Dash.</b> When you take the Dash action, your Speed increases by 10 feet for that action.<br><b>Charge Attack.</b> If you move at least 10 feet in a straight line toward a target immediately before hitting it with a melee attack roll as part of the Attack action, choose one of the following effects: gain a 1d8 bonus to the attack's damage roll, or push the target up to 10 feet away if it is no more than one size larger than you. You can use this benefit only once on each of your turns."
  },
  {
    "name": "Coating Expert",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dexterity or Intelligence 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Potent Coating.</b>When you make a damage roll that deals additional damage because of an applied coating (for example Poison damage), it ignores Resistance to that damage type.<br><b>Coating Handler.</b> You can apply a coating to a weapon or piece of ammunition as a Bonus Action, instead of an Action."
  },
  {
    "name": "Crafter",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Tool Proficiency.</b> You gain proficiency in one tool of your choice.<br><b>Expertise.</b> Choose one tool in which you have proficiency but lack Expertise. You gain Expertise with that tool."
  },
  {
    "name": "Crossbow Expert",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Ignore Loading.</b> You ignore the Loading property of the Hand Crossbow, Crossbow, and Light Crossbow (all called crossbows elsewhere in this feat). If you're holding one of them, you can load a piece of ammunition into it even if you lack a free hand.<br><b>Firing in Melee.</b> Being within 5 feet of an enemy doesn't impose Disadvantage on your attack rolls with crossbows.<br><b>Dual Wielding.</b> When you make the extra attack of the Light property, you can add your ability modifier to the damage of the extra attack if that attack is with a crossbow that has the Light property and you aren't already adding that modifier to the damage."
  },
  {
    "name": "Crusher",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Constitution 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Push.</b> Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 5 feet to an unoccupied space, provided the target is no more than one size larger than you.<br><b>Enhanced Critical.</b> When you score a critical hit that deals bludgeoning damage to a creature, attack rolls against that creature are made with advantage until the start of your next turn."
  },
  {
    "name": "Defensive Duelist",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Parry.</b> If you are wielding a finesse weapon and another creature hits you with a melee attack, you can use your Reaction to add your Proficiency Bonus to your AC, potentially causing the attack to miss you. You gain this bonus to your AC against melee attacks until the start of your next turn."
  },
  {
    "name": "Dual Weapon Defense",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand."
  },
  {
    "name": "Dual Wielder",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Enhanced Dual Wielding.</b> When you take the Attack action on your turn and attack with a One-Handed weapon, you can make one extra attack as a Bonus Action later on the same turn with a different weapon, which must be a Melee weapon that lacks the Two-Handed property. You don't add your ability modifier to the extra attack's damage unless that modifier is negative.<br><b>Quick Draw.</b> You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one."
  },
  {
    "name": "Dual Wielding Master",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dual Wielder Feat, Strength 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "When you make the extra attack of the Dual Wielder feat, you can make it as part of the Attack action, instead of as a Bonus Action. You can still make this extra attack only once per turn."
  },
  {
    "name": "Dungeon Delver",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Constitution, Intelligence, or Wisdom 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Acclimated to Darkness.</b> You gain Darkvision with a range of 60 feet. If you already have Darkvision, it's range increases by 60 feet. <br><b>Trap Proved.</b> You have advantage on saving throws made to avoid or resist traps and you have resistance to the damage dealt by traps."
  },
  {
    "name": "Durable",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Constitution 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Defy Death.</b> You have advantage on death saving throws.<br><b>Tenacious.</b> You have advantage on saving throws against effects that cause you to suffer a level of exhaustion.<br><b>Speedy Recovery.</b> As a Bonus Action, you can expend one of your Hit Point Dice, roll the die, and regain a number of Hit Points equal to the roll."
  },
  {
    "name": "Elemental Adept",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Spellcasting or Pact Magic Feature",
    "multi": -1,
    "multiAppendix": "Each time you do so, you must choose a different damage type.",
    "starter": false,
    "explanation": "<b>Energy Mastery.</b> Choose one of the following damage types: Acid, Cold, Fire, Lightning, or Thunder. Spells you cast ignore Resistance to damage of the chosen type.<br>In Addition, when you roll damage for a spell you cast that deals damage of that type, you can reroll any roll of 1 on the damage dice, but you must use the new roll, even if it is another 1."
  },
  {
    "name": "Fighting Style",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Fighting Style Feature",
    "multi": -1,
    "multiAppendix": "Each time you do so, you must choose a different fighting style.",
    "starter": false,
    "explanation": "<b>Archery.</b> You gain a +2 bonus to attack rolls you make with ranged weapons.<br><b>Blind Fighting.</b> You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.<br><b>Defense.</b> While you are wearing armor, you gain a +1 bonus to AC.<br><b>Dueling.</b> When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.<br><b>Great Weapon Fighting.</b> When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.<br><b>Interception.</b> When a creature you can see hits a target, other than you, within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction.<br><b>Mobile Fighting.</b> If you aren't wearing Heavy armor, your movement speed increases by 5 feet and when you make a melee attack against a creature, you don't provoke opportunity attacks from the creature for the rest of the turn, whether you hit or not.<br><b>Protection.</b> When a creature you can see attacks a target other than you that is within 5 feet of you, you can take a reaction to interpose your shield if you're holding one. You impose disadvantage on the triggering attack roll and all other attack rolls against the target until the start of your next turn if you remain within 5 feet of the target.<br><b>Superior Technique.</b> <i>(Prerequisite: Level 4)</i> You learn two battle maneuvers of your choice from among those available to the Fighter class. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice). Per Adventuring Period, you gain two superiority dice, which are d6s. These dice are used to fuel your maneuvers. A superiority die is expended when you use it. During an Adventuring Period, you can recover all expended Superiority Dice twice when you finish a Short Rest.<br><b>Thrown Weapon Fighting.</b> When you hit with a ranged attack using a thrown weapon, you gain a +2 bonus to the damage roll.<br><b>Two-Weapon Fighting.</b> When you make an extra attack as a result of using a weapon that has the light property, you can add your ability modifier to the damage of that attack if you aren't already adding it to the damage<br><b>Unarmed Fighting.</b> Your unarmed strikes can deal bludgeoning damage equal to 1d6 + your Strength modifier on a hit. If you aren't wielding any weapons or a shield when you make the attack roll, the d6 becomes a d8. At the start of each of your turns, you can deal 1d4 bludgeoning damage to one creature grappled by you."
  },
  {
    "name": "Grappler",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Punch and Grab.</b> When you hit a creature with an Unarmed Strike as part of the Attack action on your turn, you can use both the Damage and the Grapple option. You can use this benefit only once per turn.<br><b>Attack Advantage.</b> You have Advantage on attack rolls against a creature you are grappling.<br><b>Fast Wrestler.</b> Your Speed isn't halved when you move a creature grappled by you if the creature is your size or smaller."
  },
  {
    "name": "Great Weapon Master",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Heavy Weapon Mastery.</b> When you hit a creature with a weapon that has the Heavy property as part of the Attack action on your turn, you can cause the weapon to deal extra damage to the target. The extra damage equals your Proficiency Bonus. (every attack from the Attack action, longbows and heavy crossbows included)<br><b>Hew.</b> Immediately after you score a Critical Hit with a Melee weapon or reduce a creature to 0 Hit Points with one, you can make one attack with the same weapon as a Bonus Action."
  },
  {
    "name": "Guarded Mind",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence, Wisdom, or Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Resistant.</b> You have Advantage on Intelligence, Wisdom, and Charisma saving throws against being Charmed, Frightened, Incapacitated, Paralyzed, and Stunned.<br><b>Fortified.</b> If you fail an Intelligence, a Wisdom, or a Charisma saving throw, you can cause yourself to succeed instead. Once you use this benefit, you can't use it again until you finish a Short or Long Rest."
  },
  {
    "name": "Hardy Caster",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Spellcasting or Pact Magic Feature",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "You have Advantage on Constitution saving throws that you make to maintain Concentration."
  },
  {
    "name": "Healer",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Proficiency in Medicine, Intelligence or Wisdom 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "If you 'Treat Wounds' of a creature, you add double your proficiency bonus instead of once and the creature regains additional hit points equal to the creature’s maximum number of Hit Dice (on top of your proficiency bonus)."
  },
  {
    "name": "Heavily Armored",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Proficiency with Medium armor, Strength or Constitution 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "You gain proficiency with Heavy armor."
  },
  {
    "name": "Heavy Armor Master",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Proficiency with Heavy armor, Strength or Constitution 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Damage Reduction.</b> When you're hit by an attack while you're wearing Heavy armor, any Bludgeoning, Piercing, and Slashing damage dealt to you by that attack is reduced by an amount equal to your Proficiency Bonus."
  },
  {
    "name": "Inspiring Leader",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Wisdom or Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Bolstering Performance.</b> When you finish a Short or Long Rest, you can give an inspiring performance: a speech, song, or dance. When you do so, choose up to six allies (which can include yourself) within 30 feet of yourself who witness the performance.<br>The chosen creatures each gain Temporary Hit Points equal to your character level plus your Wisdom of Charisma modifier (choose which one, when you take this feat)."
  },
  {
    "name": "Inspiring Motivator",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Encouraging Performance.</b> As you finish a Short or Long Rest, you can give an inspiring performance: a speech, song, or dance. Give Heroic Inspiration to allies who hear or see your performance. The number of allies you can affect in this way equals your Proficiency Bonus."
  },
  {
    "name": "Keen Mind",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Lore Knowledge.</b> Choose one of the following skills: Arcana, History, Investigation, Nature, or Religion. If you lack proficiency in the chosen skill, you gain proficiency in it, and if you already have proficiency in it, you gain Expertise in it.<br><b>Quick Study.</b> You can take the Study action as a Bonus Action."
  },
  {
    "name": "Lightly Armored",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "You gain proficiency with Light armor."
  },
  {
    "name": "Lucky",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Luck Points.</b> You have a number of Luck Points equal to your Proficiency Bonus and can spend the points on the benefits below. You regain your expended Luck Points when you finish a Long Rest.<br><b>Advantage.</b> When you roll a d20 for a D20 Test, you can spend 1 Luck Point to give yourself Advantage on the roll.<br><b>Disadvantage.</b> When a creature rolls a d20 for an attack roll against you, you can spend 1 Luck Point to impose Disadvantage on that roll."
  },
  {
    "name": "Mage Slayer",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Close-Combat-Resistant.</b> You have Advantage on saving throws against spells cast by creatures within 10 feet of you.<br><b>Concentration Breaker.</b> When you damage a creature that is concentrating, it has Disadvantage on the saving throw it makes to maintain Concentration.<br><b>Spell Breaker.</b> When a creature within melee range of you casts a spell, you can use your reaction to make a melee weapon attack against that creature. If the creature takes damage from this attack, it has to make a Constitution saving throw (in addition to the saving throw it has to make to maintain its concentration, if it's concentrating on a spell). The DC equals 10 or half the damage it takes, whichever number is higher. On a failure, the creature's spell fails and has no effect."
  },
  {
    "name": "Magic Adept",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence, Wisdom, or Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Level 2 Spell.</b> Choose one level 2 spell. You learn that spell and have it always prepared. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spell (choose when you select this feat).<br><b>Free Casting.</b> You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest.<br><b>Class, Cleric, Druid, or Wizard Benefits.</b> If the chosen spell is from the Cleric, Druid, or Wizard spell list or from the spell list of your class, it gains the following additional benefits:<br><i><b>• Class Spell.</b></i> It counts as a spell of your class (or classes if multiclassing).<br><i><b>• Normal Casting.</b></i> You can also cast the spell using any spell slots you have of the appropriate level."
  },
  {
    "name": "Magic Initiate",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 3,
    "multiAppendix": "Each time you do so, you must choose a different spell list.",
    "starter": true,
    "explanation": "<b>Two Cantrips.</b> You learn two cantrips of your choice from the Cleric, Druid, or Wizard spell list.<br>Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat).<br><b>Two Level 1 Spells.</b> Choose two level 1 spells from the same list you selected for this feat's cantrips. You always have those spells prepared. You can cast each spell once without a spell slot, and you regain the ability to cast it them that way when you finish a Long Rest.<br><b>Spell Change.</b> Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list.<br><b>Feat Change.</b> Whenever you gain a new level above 3rd level, you can replace this feat with either the <i><b>Magic Adept</b></i> or <i><b>Magic Pundite</b></i> feat, granted you don't already have the feat you want this feat to exchange with. If you do so, you can only choose spells of the same class you picked when selecting this feat."
  },
  {
    "name": "Magic Pundite",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence, Wisdom, or Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Two Level 1 Spells.</b> Choose two level 1 spells. You learn those spells and have them always prepared. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat).<br><b>Free Casting.</b> You can cast them each once without a spell slot, and you regain the ability to cast them in that way when you finish a Long Rest.<br><b>Class, Cleric, Druid, or Wizard Benefits.</b> If a chosen spell is from the Cleric, Druid, or Wizard spell list or from the spell list of your class, it gains the following additional benefits:<br><i><b>• Class Spell.</b></i> It counts as a spell of your class (or classes if multiclassing).<br><i><b>• Normal Casting.</b></i> You can also cast the spell using any spell slots you have of the appropriate level."
  },
  {
    "name": "Martial Adept",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Maneuvers.</b> You learn two maneuvers of your choice from among those available to the Battle Master archetype. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).<br><b>Superiority Dice.</b> Per Adventuring Period, you gain two superiority dice, which are d6s. If you already have superiority dice from another source, you only gain one die (this die is added to any superiority dice you have from another source). These dice are used to fuel your maneuvers. A superiority die is expended when you use it. During an Adventuring Period, you can recover all expended Superiority Dice twice when you finish a Short Rest."
  },
  {
    "name": "Martial Weapon Training",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "You gain proficiency with Martial weapons."
  },
  {
    "name": "Medium Armor Master",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Proficiency with Medium armor, Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Dexterous Wearer.</b> While you're wearing Medium armor, you gain +1 bonus to AC.<br><b>Damage Reduction.</b> When you're hit by an attack while you're wearing Medium armor, any Bludgeoning, Piercing, and Slashing damage dealt to you by that attack is reduced by an amount equal to half your Proficiency Bonus."
  },
  {
    "name": "Moderately Armored",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Proficiency with Light armor, Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "You gain proficiency with Medium armor and Shields."
  },
  {
    "name": "Monster Expert",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence or Wisdom 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Monster Knowledge.</b> You have Advantage on Intelligence checks to gather information about Beasts, Dragons, Fiends, Monstrosities, Plants, and Undead.<br><b>Monster Harvester.</b> You have advantage on checks to harvest monsters."
  },
  {
    "name": "Mounted Combatant",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength, Dexterity, or Wisdom 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Mounted Strike.</b> While you are mounted, you have Advantage on attack rolls against any unmounted creature within 5 feet of your mount that is smaller than your mount.<br><b>Leap Aside.</b> If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails. For your mount to gain this benefit, you must be riding it, and neither of you can have the Incapacitated condition.<br><b>Veer.</b> While mounted, you can force an attack that hits your mount to hit you instead if you aren't Incapacitated."
  },
  {
    "name": "Observant",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence or Wisdom 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Keen Observer.</b> Choose one of the following skills: Insight, Investigation, or Perception. If you lack proficiency in the chosen skill, you gain proficiency in it, and if you already have proficiency in it, you gain Expertise in it.<br><b>Quick Search.</b> You can take the Search action as a Bonus Action."
  },
  {
    "name": "Piercer",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Puncture.</b> Once per turn, when you hit a creature with an attack that deals Piercing damage, you can reroll one of the attack's damage dice, and you must use the new roll.<br><b>Enhanced Critical.</b> When you score a critical hit that deals Piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes."
  },
  {
    "name": "Polearm Master",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Pole Strike.</b> Immediately after you take the Attack action and attack with a Quarterstaff, Spear, or a weapon that has the Heavy and Reach properties, you can use a Bonus Action to make a melee attack with the opposite end of the weapon. The weapon’s damage die for this attack is a d4, and the attack deals Bludgeoning damage.<br><b>Reactive Strike.</b> While you are holding a Quarterstaff, Spear, or a weapon that has the Heavy and Reach properties, you can take a Reaction to make one melee attack against a creature that enters the reach you have with that weapon."
  },
  {
    "name": "Prodigy",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "Choose one of the three options:<br><b>Skilled.</b> You gain proficiency in any combination of four skills or tools of your choice (pick at least one tool proficiency).<br><b>Skill Expert.</b> You gain proficiency in any combination of two skills or tools of your choice. Choose one skill in which you have proficiency but lack Expertise. You gain Expertise with that skill.<br><b>Skill Master.</b> Choose two skills in which you have proficiency but lack Expertise. You gain Expertise with these skills."
  },
  {
    "name": "Resilient",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "Choose one ability in which you lack saving throw proficiency. You gain proficiency in saving throws using the chosen ability."
  },
  {
    "name": "Ritual Caster",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence, Wisdom, or Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Ritual Spells.</b> Choose a number of spells that have the Ritual tag with a combined level equal to your proficiency bonus. You always have those spells prepared, and you can cast them with any spell slots you have. The spells' spellcasting ability is Intelligence, Wisdom, or Charisma (choose when you select this feat).<br><b>Ritual Change.</b> Whenever you gain a new level, you can replace spells you chose for this feat with different ritual spells following the rules above.<br><b>Quick Ritual.</b> With this benefit, you can cast a Ritual spell that you have prepared using its regular casting time rather than the extended time for a Ritual. Doing so doesn't require a spell slot. Once you cast the spell in this way, you can't use this benefit again until you finish a Long Rest."
  },
  {
    "name": "Savage Attacker",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "You've trained to deal particularly damaging strikes. When you hit a target with a weapon, you can roll the weapon's damage dice twice and use either roll against the target."
  },
  {
    "name": "Sentinel",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Guardian.</b> Immediately after a creature within 5 feet of you takes the Disengage action or hits a target other than you with an attack you can make an Opportunity Attack against that creature.<br><b>Halt.</b> When you hit a creature with an Opportunity Attack, the creature's Speed becomes 0 for the rest of the current turn."
  },
  {
    "name": "Sharpshooter",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Bypass Cover.</b> Your ranged weapon attacks ignore half cover and three-quarters cover.<br><b>Firing in Melee.</b> Being within 5 feet of an enemy doesn't impose Disadvantage on your attack rolls with Ranged weapons.<br><b>Long Shots.</b> Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls."
  },
  {
    "name": "Shield Master",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Proficiency with shields, Strength 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Shield Bash.</b> If you attack a creature within 5 feet of you as part of the Attack action and hit with a Melee weapon, you can immediately bash the target with your Shield if it's equipped, forcing the target to make a Strength saving throw 8DC 8 plus your Strength modifier and Proficiency Bonus). On a failed save, you either push the target 5 feet from you or cause it to fall prone (your choice). You can use this benefit only once on each of your turns.<br><b>Interpose Shield.</b> If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your Reaction to take no damage if you succeed on the saving throw and are holding a Shield."
  },
  {
    "name": "Skulker",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Blindsight.</b> You have Blindsight with a range of 10 feet.<br><b>Fog of War.</b> You exploit the distractions of battle, gaining Advantage on any Dexterity (Stealth) check you make as part of the Hide action during combat.<br><b>Sniper.</b> If you make an attack roll while hidden and the roll misses, making the attack roll doesn't reveal your location."
  },
  {
    "name": "Slasher",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Hamstring.</b> Once per turn when you hit a creature with an attack that deals slashing damage, you can reduce the speed of the target by 10 feet until the start of your next turn.<br><b>Enhanced Critical.</b> When you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has disadvantage on all attack rolls."
  },
  {
    "name": "Speedy",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dexterity or Constitution 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Speed Increase.</b> Your Speed increases by 10 feet.<br><b>Dash over Difficult Terrain.</b> When you take the Dash action on your turn, difficult terrain doesn't cost you extra movement for the rest of that turn.<br><b>Agile Movement.</b> Opportunity Attacks have Disadvantage against you."
  },
  {
    "name": "Spell Accuracy",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "Whenever you have advantage on a spell attack roll, you can reroll one of the dice once."
  },
  {
    "name": "Spell Sniper",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Spellcasting or Pact Magic Feature",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Bypass Cover.</b> Your attack rolls for spells ignore half cover and three-quarters cover.<br><b>Casting in Melee.</b> Being within 5 feet of an enemy doesn't impose Disadvantage on your attack rolls with spells.<br><b>Increased Range.</b> When you cast a spell that has a range of at least 10 feet and requires you to make an attack roll, you can increase the spell's range by 60 feet."
  },
  {
    "name": "Spellfighter",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence, Wisdom, or Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Quick Cantrip Casting.</b>You can cast cantrips that require an Attack Roll or Saving Throw as a Bonus Action rather than an Action. During an Adventuring Period, you can use this feature a number of times equal to your Proficiency Bonus.<br><b>Offensive Cantrips.</b> You learn two cantrips of your choice that require an Attack Roll or Saving Throw. Choose the cantrips from any spell list. The two cantrips don't have to be from the same list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat).<br><b>Class Spells.</b> They count as spells of your class (or classes if multiclassing).<br><b>Spell Change.</b> Whenever you gain a new level, you can replace one of the cantrips you chose for this feat with a different cantrip."
  },
  {
    "name": "Spellforged Attunement",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Spellcasting or Pact Magic Feature",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "When you are attuned to a magic item that allows you to cast one or more spells without using a spell slot, you can also cast the spells using any spell slots you have of the appropriate level or as a ritual if the spell has the Ritual tag."
  },
  {
    "name": "Tavern Brawler",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Enhanced Unarmed Strike.</b> When you hit with your Unarmed Strike and deal damage, you can deal Bludgeoning damage equal to 1d4 plus your Strength modifier instead of the normal damage of an Unarmed Strike.<br><b>Damage Rerolls.</b> Whenever you roll a damage die for your Unarmed Strike, you can rerall the die if it rolls a 1, and you must use the new roll.<br><b>Improvised Weaponry.</b> You have proficiency with improvised weapons.<br><b>Push.</b> When you hit a creature with an Unarmed Strike as part of the Attack action on your turn, you can deal damage to the target and also push it 5 feet away from you. You can use this benefit only once per turn."
  },
  {
    "name": "Telekinetic",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence, Wisdom, or Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "Choose either Intelligence, Wisdom, or Charisma for this feat. You learn to move things with your mind, granting you the following benefits:<br><b>Minor Telekinesis.</b> You learn the mage hand cantrip. You can cast it without verbal or somatic components, you can make the spectral hand invisible, and its range increases by 30 feet when you cast it. Its spellcasting ability is the chosen ability.<br><b>Telekinetic Shove.</b> As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score you chose) or be moved 5 feet toward you or away from you. A creature can willingly fail this save."
  },
  {
    "name": "Telepathic",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Intelligence, Wisdom, or Charisma 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Telepathic Utterance.</b> You can speak telepathically to any creature you can see within 60 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.<br><b>Detect Thoughts.</b> You can cast the detect thoughts spell, requiring no spell slot or components, and you must finish a long rest before you can cast it this way again. You choose the spell's spellcasting ability at the time you pick this feat. You can choose between Intelligence, Wisdom, or Charisma. If you have spell slots of 2nd level or higher, you can cast this spell with them."
  },
  {
    "name": "Tough",
    "category": "General",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points."
  },
  {
    "name": "War Caster",
    "category": "Spellcasting",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Spellcasting or Pact Magic Feature",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "<b>Reactive Spell.</b> When a creature provokes an Opportunity Attack from you by leaving your reach, you can take a Reaction to cast a spell at the creature rather than making an Opportunity Attack. The spell must have a casting time of 1 action and must target only that creature.<br><b>Weapon Focus.</b> You can use any Weapon or Shield you are wielding as a Spell Casting Focus for your spells and with them you can perform the Somatic Components of spells even when you have weapons or a shield in one or both hands."
  },
  {
    "name": "Weapon Accuracy",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": false,
    "explanation": "Whenever you have advantage on a weapon attack roll, you can reroll one of the dice once."
  },
  {
    "name": "Weapon Master",
    "category": "Martial",
    "subcategory": "",
    "cost": 1,
    "prerequisite": "Strength or Dexterity 13+",
    "multi": 1,
    "multiAppendix": "",
    "starter": true,
    "explanation": "<b>Mastery Property.</b> Your training with weapons allows you to use the mastery property of one kind of Simple or Martial weapon of your choice, provided you have proficiency with it. Whenever you finish a Long Rest, you can change the kind of weapon to another eligible kind."
  }
]